/**
 * 4. Создать программу, которая будет проверять, является ли слово из пяти букв.
 *
 * Создать программу, которая будет проверять, является ли слово из пяти букв, введённое пользователем,
 * палиндромом (примеры: «комок», «ротор»). Если введено слово не из 5 букв, то сообщать об ошибке. Программа
 * должна нормально обрабатывать слово, даже если в нём использованы символы разного регистра. Например,
 * слова «Комок» или «РОТОР» следует также считать палиндромами.
 */
package andrusyak.task_04;