/**
 * 1. Используя класс ConsoleInput в классе StartUI обеспечить полноценную работу всего приложения
 *
 * Используя класс ConsoleInput в классе StartUI обеспечить полноценную работу всего приложения. Пользователю должно
 * отображаться меню. Он может выйти из приложения и выполнять все действия описанные в первом задании.
 *
 * 2. Используя класс StubInput написать тесты проверяющие поведение пользователя
 *
 * Используя класс StubInput написать JUnit тесты эмулирующие поведение пользователя. То есть за счет статических данных,
 * пользователь выбирает пункты меню. Вводить данные, выводить данные, и выходит из приложение. Отличие данного задания
 * от первого в том. Что все данные мы заносим в программу. А в первом задание пользователь вводит их с консоли.
 *
 * 3. Проанализировать полученный код и попытаться выделить в нем группы классов и методов
 *
 * Проанализировать полученный код и попытаться выделить в нем группы классов и методов, которые можно было бы заменять
 * на интерфейс. Описать решение в отдельном файле. Добавить его в репозиторий. Не изменять код.
 */
package andrusyak;