/**
 * Тестовое задание.
 *
 * 1. реализовать шахматную доску.
 * 2. должна быть возможность двигать фигуру.
 * 3. система должна проверять корректность движения фигуры.
 * 4. каждая фигура должна двигаться в соответствии со своей логикой.
 * 5. нельзя ставить на занятые поля.
 * 6. нельзя перемещать фигуру, если на пути стоит другая фигура. кроме коня.
 * 7. в этом задании не надо делать меню и пользователей. меня интересует только логика. а не ввод данных.
 * 8. все выше описанные поведения должны быть проверен через Junit tests.
 */
package andrusyak.test_task;