/**
 * 5. Создать программу консольный чат.
 *
 * Создать программу консольный чат. Пользователь вводит слово-фразу, программа берет случайную фразу из текстового
 * файла и выводит в ответ. Программа замолкает если пользователь вводит слово «стоп» при этом он может продолжать
 * отправлять сообщения в чат. Если пользователь вводит слово «продолжить» , программа снова начинает отвечать.
 * При вводе слова «закончить» программа прекращает работу. Запись диалога включая, слова-команды
 * стоп/продолжить/закончить записать в текстовый лог.

 */
package andrusyak.task_05;