/**
 * 1. Реализовать класс Tracker
 *
 * Реализовать класс Tracker. Данный класс используется как хранилище для заявок. В нем должны быть методы: добавление,
 * редактирования, удаления, получения списка всех заявок и списка по фильтру.
 *
 * 2. StartUi продемонстрировать все возможности класса Tracker
 *
 * В классе StartUi продемонстрировать все возможности класса Tracker. То есть добавить. редактировать. вывести на экран.
 * Здесь надо последовательно выполнить вызов всех методы со статическими данными.
 *
 * 3. Приложение должно собираться в jar и запускаться командой java –jar tracker.jar
 *
 * Приложение должно собираться в jar и запускаться командой java –jar tracker.jar. Для этого в pom.xml нужно добавить
 * manifect описание
 */
package andrusyak;