/**
 * 1. Создание UML системе заявок.
 *
 * Описание общей задачи. Необходимо создать программу учета заявок. Работать приложение должно в консоли.
 * Клиент запускают программу java –jar tracker.jar. В консоли отображается приветствие и описание программы.
 * После этого пользователю отображается консольное меню. Список всех действий, которые поддерживаются в системе.
 * Пользователю предлагается выбирать действие, которое он хочет совершит. Когда действие закончено.
 * Пользователю опять отображается меню. В меню должен быть пункт выйти.
 *
 * Всю разработку необходимо разбить на этапы.
 *
 * Приложение должно осуществлять следующие действия.
 *
 * 1. Добавление новой заявки
 * 2. Редактирования заявки.
 * 3. Удаления заявки.
 * 4. Отображение списка всех заявок.
 * 5. Отображения заявок с условием фильтра.
 * 6. Добавлять к заявки комментарий.
 *
 * В заявке должна быть следующая информация. Имя. Описание. Дата создания. И список комментариев.
 *
 * Задания.
 *
 * 1.Используя программу PowerPoint или ArgoUML создать диаграмму классов. В ней нужно отобразить все классы,
 * которые будут в системе. В классе указать публичные поля и методы. В методах обязательно указать входящие параметры.
 *
 * 2. Сделать описание каждого класса. В описании нужно указать. Для чего создан класс, что он будет делать.
 *
 * 3. Нарисовать UML схему взаимодействия классов. Стрелками указать какие классы будут взаимодействовать друг с другом
 *
 * 4. Нарисовать блок схему основного цикла программы - цикла отображения меню и действий.
 *
 * 5. Все схему нужно добавить в репозиторий.
 *
 * Важно. На данном этапе мы не проводим кодирование. Необходимо только составить план.
 */
package andrusyak.task_01;